src/cf/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСтола</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пожелание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученНаКухне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/НаправленияСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>НаправленияСообщенийRMQ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ЗаказКлиента/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	АктуальныйСтатусЗаказа = РегистрыСведений.СтатусыЗаказов.АктуальныйСтатусЗаказа(Ссылка);
	
	Если АктуальныйСтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка()
		Или АктуальныйСтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.Создан Тогда
		
		Если АктуальныйСтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка() Тогда
			РегистрыСведений.СтатусыЗаказов.ОбновитьСтатусЗаказа(Ссылка, Перечисления.СтатусыЗаказовКлиентов.Создан);
			ИсходящееСообщение = Документы.ИсходящееСообщение.СоздатьИсходящееСообщениеПоЗаказу(Ссылка);
			
		Иначе
			ИсходящиеСообщения = РегистрыСведений.СвязиОбъектовИСообщенийRMQ.НайтиСообщения(Ссылка, Перечисления.НаправленияСообщенийRMQ.Исходящее, "orders", Истина);
			Если ИсходящиеСообщения.Количество() > 0 Тогда
				ИсходящееСообщение = ИсходящиеСообщения[0];
			Иначе
				ИсходящееСообщение = Документы.ИсходящееСообщение.СоздатьИсходящееСообщениеПоЗаказу(Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Проведен Тогда
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(Ссылка);
			ПараметрыЗадания.Добавить(ИсходящееСообщение);
			
			ФоновыеЗадания.Выполнить(
				"РаботаССообщениямиRMQ.ОтправитьИсходящееСообщениеПоЗаказу",
				ПараметрыЗадания,
				Новый УникальныйИдентификатор,
				"Отправка сообщения в RMQ"
			);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
